Revit 2018 API
StructuralSectionLAngle Constructor
Overload List
Name | Description
StructuralSectionLAngle(Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double) |  Obsolete.
 Creates a new instance of Structural Section L Angle shape with the associated set of parameters, used to attach to structural element.
StructuralSectionLAngle(Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double)
 Creates a new instance of Structural Section L Angle shape with the associated set of parameters, used to attach to structural element.
See Also
StructuralSectionLAngle Class
StructuralSectionLAngle Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace